
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |   🔴 Destroy |
|:---------:|--------:|----------:|------------:|
|     ✅     |       5 |         0 |           1 |
## Affected resources by action

|  Action  | Resources                                                                        |
|:--------:|:---------------------------------------------------------------------------------|
|    🟢     | `module.postfix-tester.aws_iam_role.role-tester`                                 |
|    🟢     | `module.postfix-tester.aws_iam_role_policy_attachment.role-admin-permissions[0]` |
|    🟢     | `module.postfix-tester.aws_iam_role_policy_attachment.role-permissions`          |
|    🟢     | `module.postfix-tester.aws_iam_role_policy_attachment.role-pytest-permissions`   |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.postfix-tester.aws_iam_policy.role-permissions must be replaced
-/+ resource "aws_iam_policy" "role-permissions" {
      ~ arn         = "arn:aws:iam::303467602807:policy/pypiserver-tester-permissions20240322140500857200000001" -> (known after apply)
      ~ id          = "arn:aws:iam::303467602807:policy/pypiserver-tester-permissions20240322140500857200000001" -> (known after apply)
      ~ name        = "pypiserver-tester-permissions20240322140500857200000001" -> (known after apply)
      ~ name_prefix = "pypiserver-tester-permissions" -> "postfix-tester-permissions" # forces replacement
      ~ policy_id   = "ANPAUNKAUEN3S4IFX4ZRU" -> (known after apply)
      - tags        = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.postfix-tester.aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-postfix:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-postfix"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "postfix-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)
    }

  # module.postfix-tester.aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "postfix-tester"
    }

  # module.postfix-tester.aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "postfix-tester"
    }

  # module.postfix-tester.aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20240322140500857500000002"
      + role       = "postfix-tester"
    }

Plan: 5 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDUsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDF9fQ==
```
</details>